/*
長い定数をまとめる
＜＜命名ルール＞＞
LCT.ジャンル(UPPER).定数名(lower)
LCT.ジャンル(UPPER).サブジャンル(UpperCamelCase).定数名(camel)
*/

var LCT = LCT || {};
//ユニット制関連データベース
LCT.UNIT = {};
LCT.UNIT.unitlist = {
  b1301: {
    name: '東京Ｕ',
    bases: [1306, 1304, 1302, 1307, 1303, 8006, 8005],
    employee: ['000006', '000070', '000198', '000300', '000316', '000369']
  },
  b4002: {
    name: '福岡中央Ｕ',
    bases: [4016, 4024, 4035, 4006, 4045, 4014, 4010, 8009],
    employee: ['000029', '000036', '000049', '000068', '000095', '000103', '000111', '000187', '000201', '000302', '000306', '000359']
  },
  b4004: {
    name: '福岡西Ｕ',
    bases: [4009, 4001, 4002, 4044, 4037, 4040, 8012],
    employee: []
  },
  b4006: {
    name: '福岡東Ｕ',
    bases: [4019, 4004, 4020, 4039, 4018, 8018],
    employee: []
  },
  b4008: {
    name: '北九州東Ｕ',
    bases: [4033, 4030, 4027, 4034, 4029, 4048],
    employee: []
  },
  b4009: {
    name: '北九州西Ｕ',
    bases: [4047, 4021, 4008, 4050, 4041],
    employee: []
  },
  b4101: { name: '佐賀Ｕ', bases: [4103, 4108, 4107, 8013], employee: [] },
  b4202: {
    name: '長崎南Ｕ',
    bases: [4207, 4214, 4209, 4206, 8011],
    employee: []
  },
  b4204: { name: '長崎北Ｕ', bases: [4208, 4201, 4204, 4205], employee: [] },
  b4203: { name: '佐世保Ｕ', bases: [4212, 4211, 4213], employee: [] },
  b4301: {
    name: '熊本Ｕ',
    bases: [4303, 4307, 4309, 4310, 4306],
    employee: []
  },
  b4402: {
    name: '大分Ｕ',
    bases: [4406, 4410, 4407, 4401, 4403, 4408, 4405, 4409],
    employee: []
  },
  b4501: { name: '宮崎Ｕ', bases: [4508, 4509, 4504, 4505], employee: [] },
  b4602: {
    name: '鹿児島Ｕ',
    bases: [4602, 4605, 4604, 4608, 4607, 4601],
    employee: []
  },
  b3401: {
    name: '広島北Ｕ',
    bases: [3404, 3405, 3414, 3408, 3403, 8015],
    employee: ['000183', '000226', '000292', '000308']
  },
  b3403: {
    name: '広島南Ｕ',
    bases: [3416, 3406, 3401, 3410, 3407, 8017],
    employee: ['000231', '000262', '000368', '000376']
  },
  b3501: {
    name: '下関Ｕ',
    bases: [3501, 3502, 3505, 3504],
    employee: ['000185', '000230', '000319']
  },
  b3302: {
    name: '岡山北Ｕ',
    bases: [3311, 3313, 3302, 3301, 3314, 3309, 3308, 8010, 8014],
    employee: []
  },
  b3303: { name: '岡山南Ｕ', bases: [3304, 3303, 3312, 3305], employee: [] },
  b3201: { name: '松江Ｕ', bases: [3201, 3203, 3202], employee: [] },
  b3701: { name: '高松Ｕ', bases: [3702, 3707, 3706, 3701], employee: [] },
  b7001: {
    name: 'オンラインＵ',
    bases: [7002, 7003, 7001, 7022, 7023, 7024, 7025, 7026, 7027, 7028, 7011, 7021, 7041, 7031],
    employee: []
  },
  b7101: { name: 'NALUＵ', bases: [7004, 8101, 8102], employee: [] }
};
LCT.UNIT.unitOrder = {};
Object.keys(LCT.UNIT.unitlist).forEach((id, index) => {
  LCT.UNIT.unitOrder[LCT.UNIT.unitlist[id].name] = index;
});

LCT.UNIT.baseNXTData = {
  head: ['blockname', 'blockcd', 'unitname', 'unitcd', 'basename', 'basecd', 'realbase', 'closed', 'pref', '25change'],
  body: [
    ['関東', 'a5011', '東京', 'b1301', '早稲田', '1306', 'TRUE', '', '東京', ''],
    ['関東', 'a5011', '東京', 'b1301', '上板橋駅前', '1304', 'TRUE', '', '東京', ''],
    ['関東', 'a5011', '東京', 'b1301', '要町', '1302', 'TRUE', '', '東京', ''],
    ['関東', 'a5011', '東京', 'b1301', '中野駅前', '1307', 'TRUE', '', '東京', ''],
    ['関東', 'a5011', '東京', 'b1301', '豊玉', '1303', 'TRUE', '', '東京', ''],
    ['関東', 'a5011', '東京', 'b1301', 'みらいミッテ早稲田', '8006', 'FALSE', '', '東京', ''],
    ['関東', 'a5011', '東京', 'b1301', 'みらいミッテ要町', '8005', 'FALSE', '', '東京', ''],
    ['関東', 'a5011', '東京', 'b1301', 'みらいミッテ豊玉', '8020', 'FALSE', '', '東京', ''],
    ['関東', 'a5011', '東京', 'b1301', '志木駅前', '1101', 'TRUE', '', '', ''],
    ['関東', 'a5011', '東京', 'b1301', '和光', '1102', 'TRUE', '', '', ''],
    ['福岡', 'a5021', '福岡中央', 'b4002', '薬院', '4016', 'TRUE', '', '福岡', ''],
    ['福岡', 'a5021', '福岡中央', 'b4002', '大橋駅前', '4024', 'TRUE', '', '福岡', 'unitcd'],
    ['福岡', 'a5021', '福岡中央', 'b4002', '長住', '4035', 'TRUE', '', '福岡', 'unitcd'],
    ['福岡', 'a5021', '福岡中央', 'b4002', '井尻', '4006', 'TRUE', '', '福岡', 'unitcd'],
    ['福岡', 'a5021', '福岡中央', 'b4002', 'みらいミッテ薬院', '8009', 'FALSE', '', '福岡', ''],
    ['福岡', 'a5021', '福岡南', 'b4101', '西鉄久留米', '4010', 'TRUE', '', '福岡', ''],
    ['福岡', 'a5021', '福岡南', 'b4101', '小郡', '4014', 'TRUE', '', '福岡', ''],
    ['福岡', 'a5021', '福岡南', 'b4101', '都府楼前', '4045', 'TRUE', '', '福岡', ''],
    ['福岡', 'a5021', '福岡西', 'b4004', '西新修猷館前', '4009', 'TRUE', '', '福岡', ''],
    ['福岡', 'a5021', '福岡西', 'b4004', '六本松', '4001', 'TRUE', '', '福岡', ''],
    ['福岡', 'a5021', '福岡西', 'b4004', '原', '4002', 'TRUE', '', '福岡', ''],
    ['福岡', 'a5021', '福岡西', 'b4004', '橋本', '4044', 'TRUE', '', '福岡', ''],
    ['福岡', 'a5021', '福岡西', 'b4004', '九大学研都市', '4037', 'TRUE', '', '福岡', ''],
    ['福岡', 'a5021', '福岡西', 'b4004', '前原駅前', '4040', 'TRUE', '', '福岡', ''],
    ['福岡', 'a5021', '福岡西', 'b4004', 'みらいミッテ西新', '8012', 'FALSE', '', '福岡', ''],
    ['福岡', 'a5021', '福岡東', 'b4006', '香椎', '4019', 'TRUE', '', '福岡', ''],
    ['福岡', 'a5021', '福岡東', 'b4006', '箱崎', '4004', 'TRUE', '', '福岡', ''],
    ['福岡', 'a5021', '福岡東', 'b4006', '和白', '4020', 'TRUE', '', '福岡', ''],
    ['福岡', 'a5021', '福岡東', 'b4006', '志免南里', '4039', 'TRUE', '', '福岡', ''],
    ['福岡', 'a5021', '福岡東', 'b4006', '古賀駅前', '4018', 'TRUE', '', '福岡', ''],
    ['福岡', 'a5021', '福岡東', 'b4006', '東郷', '4047', 'TRUE', '', '福岡', ''],
    ['福岡', 'a5021', '福岡東', 'b4006', '赤間', '4021', 'TRUE', '', '福岡', ''],
    ['福岡', 'a5021', '福岡東', 'b4006', 'みらいミッテ香椎', '8018', 'FALSE', '', '福岡', ''],
    ['福岡', 'a5021', '北九州西', 'b4009', '西小倉', '4033', 'TRUE', '', '福岡', ''],
    ['福岡', 'a5021', '北九州西', 'b4009', '荒生田', '4048', 'TRUE', '', '福岡', ''],
    ['福岡', 'a5021', '北九州西', 'b4009', '戸畑', '4029', 'TRUE', '', '福岡', ''],
    ['福岡', 'a5021', '北九州西', 'b4009', '折尾駅前', '4008', 'TRUE', '', '福岡', ''],
    ['福岡', 'a5021', '北九州西', 'b4009', '高須', '4050', 'TRUE', '', '福岡', ''],
    ['福岡', 'a5021', '北九州西', 'b4009', '八幡', '4041', 'TRUE', 'TRUE', '福岡', ''],
    ['福岡', 'a5021', '北九州東', 'b4008', '門司駅前', '4030', 'TRUE', '', '福岡', ''],
    ['福岡', 'a5021', '北九州東', 'b4008', '下曽根', '4034', 'TRUE', '', '福岡', ''],
    ['福岡', 'a5021', '北九州東', 'b4008', '守恒駅前', '4027', 'TRUE', '', '福岡', ''],
    ['福岡', 'a5021', '北九州東', 'b4008', '山の田', '3501', 'TRUE', '', '山口', ''],
    ['福岡', 'a5021', '北九州東', 'b4008', '安岡', '3505', 'TRUE', '', '山口', ''],
    ['福岡', 'a5021', '北九州東', 'b4008', '長府駅前', '3504', 'TRUE', '', '山口', ''],
    ['福岡', 'a5021', '北九州東', 'b4008', '新下関', '3502', 'TRUE', 'TRUE', '山口', ''],
    ['福岡', 'a5021', '駿台Diverse', 'b4011', '小倉駅', '4051', 'TRUE', '', '', ''],
    ['福岡', 'a5021', '駿台Diverse', 'b4011', '新宮中央', '4052', 'TRUE', '', '', ''],
    ['九州', 'a5023', '佐賀', 'b4101', '佐賀駅前', '4103', 'TRUE', '', '佐賀', 'blockcd'],
    ['九州', 'a5023', '佐賀', 'b4101', '本庄大崎', '4107', 'TRUE', '', '佐賀', 'blockcd'],
    ['九州', 'a5023', '佐賀', 'b4101', '鳥栖', '4108', 'TRUE', '', '佐賀', 'blockcd'],
    ['九州', 'a5022', '佐賀', 'b4101', 'みらいミッテ佐賀', '8013', 'FALSE', '', '佐賀', 'blockcd'],
    ['九州', 'a5023', '長崎', 'b4202', '長崎駅前', '4207', 'TRUE', '', '長崎', 'blockcd'],
    ['九州', 'a5023', '長崎', 'b4202', '城栄', '4209', 'TRUE', '', '長崎', 'blockcd'],
    ['九州', 'a5023', '長崎', 'b4202', '南長崎', '4206', 'TRUE', '', '長崎', 'blockcd'],
    ['九州', 'a5023', '長崎', 'b4202', '住吉', '4208', 'TRUE', '', '長崎', 'blockcd'],
    ['九州', 'a5023', '長崎', 'b4202', '葉山', '4204', 'TRUE', '', '長崎', 'blockcd'],
    ['九州', 'a5023', '長崎', 'b4202', '長与', '4205', 'TRUE', '', '長崎', 'blockcd'],
    ['九州', 'a5023', '長崎', 'b4202', 'みらいミッテ長崎駅前', '8011', 'FALSE', '', '長崎', 'blockcd'],
    ['九州', 'a5023', '長崎', 'b4202', '本原', '4201', 'TRUE', 'TRUE', '長崎', 'blockcd'],
    ['九州', 'a5023', '熊本', 'b4301', '水前寺', '4303', 'TRUE', '', '熊本', 'blockcd'],
    ['九州', 'a5023', '熊本', 'b4301', '健軍', '4307', 'TRUE', '', '熊本', 'blockcd'],
    ['九州', 'a5023', '熊本', 'b4301', '武蔵ケ丘', '4310', 'TRUE', '', '熊本', 'blockcd'],
    ['九州', 'a5023', '熊本', 'b4301', '長嶺', '4306', 'TRUE', '', '熊本', 'blockcd'],
    ['九州', 'a5023', '大分', 'b4402', '大分駅前', '4406', 'TRUE', '', '大分', 'blockcd'],
    ['九州', 'a5023', '大分', 'b4402', '春日', '4407', 'TRUE', '', '大分', 'blockcd'],
    ['九州', 'a5023', '大分', 'b4402', '南大分', '4401', 'TRUE', '', '大分', 'blockcd'],
    ['九州', 'a5023', '大分', 'b4402', '光吉', '4403', 'TRUE', '', '大分', 'blockcd'],
    ['九州', 'a5023', '大分', 'b4402', '戸次', '4408', 'TRUE', '', '大分', 'blockcd'],
    ['九州', 'a5023', '大分', 'b4402', '明野', '4409', 'TRUE', '', '大分', 'blockcd'],
    ['九州', 'a5023', '大分', 'b4402', '滝尾', '4405', 'TRUE', 'TRUE', '大分', 'blockcd'],
    ['九州', 'a5023', '大分', 'b4402', 'みらいミッテ大分駅前', '8019', 'FALSE', '', '大分', 'blockcd'],
    ['九州', 'a5023', '宮崎', 'b4501', '宮崎駅前', '4508', 'TRUE', '', '宮崎', 'blockcd'],
    ['九州', 'a5023', '宮崎', 'b4501', '生目大塚', '4509', 'TRUE', '', '宮崎', 'blockcd'],
    ['九州', 'a5023', '宮崎', 'b4501', '花ヶ島', '4504', 'TRUE', '', '宮崎', 'blockcd'],
    ['九州', 'a5023', '宮崎', 'b4501', '赤江', '4505', 'TRUE', '', '宮崎', 'blockcd'],
    ['九州', 'a5023', '鹿児島', 'b4602', '鹿児島中央', '4602', 'TRUE', '', '鹿児島', 'blockcd'],
    ['九州', 'a5023', '鹿児島', 'b4602', '紫原', '4604', 'TRUE', '', '鹿児島', 'blockcd'],
    ['九州', 'a5023', '鹿児島', 'b4602', '宇宿', '4608', 'TRUE', '', '鹿児島', 'blockcd'],
    ['九州', 'a5023', '鹿児島', 'b4602', '東谷山', '4607', 'TRUE', '', '鹿児島', 'blockcd'],
    ['九州', 'a5023', '鹿児島', 'b4602', '慈眼寺', '4601', 'TRUE', '', '鹿児島', 'blockcd'],
    ['中四国', 'a5031', '広島北', 'b3401', '白島', '3404', 'TRUE', '', '広島', ''],
    ['中四国', 'a5031', '広島北', 'b3401', '緑井', '3414', 'TRUE', '', '広島', ''],
    ['中四国', 'a5031', '広島北', 'b3401', '上安', '3408', 'TRUE', '', '広島', ''],
    ['中四国', 'a5031', '広島北', 'b3401', '中広', '3403', 'TRUE', '', '広島', ''],
    ['中四国', 'a5031', '広島北', 'b3401', 'みらいミッテ緑井', '8015', 'FALSE', '', '広島', ''],
    ['中四国', 'a5031', '広島北', 'b3401', 'みらいミッテ中広', '8016', 'FALSE', 'TRUE', '広島', ''],
    ['中四国', 'a5031', '広島南', 'b3403', '広島駅前', '3416', 'TRUE', '', '広島', ''],
    ['中四国', 'a5031', '広島南', 'b3403', '中筋', '3405', 'TRUE', '', '広島', ''],
    ['中四国', 'a5031', '広島南', 'b3403', '古江', '3406', 'TRUE', '', '広島', ''],
    ['中四国', 'a5031', '広島南', 'b3403', '皆実町', '3401', 'TRUE', '', '広島', ''],
    ['中四国', 'a5031', '広島南', 'b3403', '安芸府中', '3410', 'TRUE', '', '広島', ''],
    ['中四国', 'a5031', '広島南', 'b3403', '西条', '3407', 'TRUE', 'TRUE', '広島', ''],
    ['中四国', 'a5031', '広島南', 'b3403', 'みらいミッテ安芸府中', '8017', 'FALSE', '', '広島', ''],
    ['中四国', 'a5031', '岡山北', 'b3302', '岡山駅前', '3311', 'TRUE', '', '岡山', ''],
    ['中四国', 'a5031', '岡山北', 'b3302', 'HS岡山駅前', '3313', 'TRUE', '', '岡山', ''],
    ['中四国', 'a5031', '岡山北', 'b3302', '岡北', '3302', 'TRUE', '', '岡山', ''],
    ['中四国', 'a5031', '岡山北', 'b3302', '伊島', '3301', 'TRUE', '', '岡山', ''],
    ['中四国', 'a5031', '岡山北', 'b3302', '津高', '3308', 'TRUE', '', '岡山', ''],
    ['中四国', 'a5031', '岡山北', 'b3302', 'みらいミッテ岡山駅前', '8010', 'FALSE', '', '岡山', ''],
    ['中四国', 'a5031', '岡山北', 'b3302', 'みらいミッテ伊島', '8014', 'FALSE', '', '岡山', ''],
    ['中四国', 'a5031', '岡山南', 'b3303', '国富', '3304', 'TRUE', '', '岡山', ''],
    ['中四国', 'a5031', '岡山南', 'b3303', '西古松', '3303', 'TRUE', '', '岡山', ''],
    ['中四国', 'a5031', '岡山南', 'b3303', '高島', '3309', 'TRUE', '', '岡山', ''],
    ['中四国', 'a5031', '岡山南', 'b3303', '中庄', '3312', 'TRUE', 'TRUE', '岡山', ''],
    ['中四国', 'a5031', '岡山南', 'b3303', '庭瀬', '3305', 'TRUE', 'TRUE', '岡山', ''],
    ['中四国', 'a5031', '高松', 'b3701', '栗林', '3702', 'TRUE', '', '香川', ''],
    ['中四国', 'a5031', '高松', 'b3701', '木太南', '3707', 'TRUE', '', '香川', ''],
    ['中四国', 'a5031', '高松', 'b3701', '水田', '3706', 'TRUE', '', '香川', ''],
    ['中四国', 'a5031', '高松', 'b3701', '番町', '3701', 'TRUE', '', '香川', ''],
    ['NALUオンライン', 'a7001', 'NALUオンライン', 'b7101', 'NALUオンライン', '7005', 'FALSE', '', '', ''],
    ['NALUオンライン', 'a7001', 'NALUオンライン', 'b7101', 'オンライン１対１', '7002', 'FALSE', '', '', ''],
    ['NALUオンライン', 'a7001', 'NALUオンライン', 'b7101', 'オンラインatama+', '7003', 'FALSE', '', '', ''],
    ['NALUオンライン', 'a7001', 'NALUオンライン', 'b7101', 'オンライングループ１', '7001', 'FALSE', '', '', ''],
    ['NALUオンライン', 'a7001', 'NALUオンライン', 'b7101', 'オンライングループ２', '7022', 'FALSE', '', '', ''],
    ['NALUオンライン', 'a7001', 'NALUオンライン', 'b7101', 'オンライングループ３', '7023', 'FALSE', '', '', ''],
    ['NALUオンライン', 'a7001', 'NALUオンライン', 'b7101', 'オンライングループ４', '7024', 'FALSE', '', '', ''],
    ['NALUオンライン', 'a7001', 'NALUオンライン', 'b7101', 'オンライングループ５', '7025', 'FALSE', '', '', ''],
    ['NALUオンライン', 'a7001', 'NALUオンライン', 'b7101', 'オンライングループ６', '7026', 'FALSE', '', '', ''],
    ['NALUオンライン', 'a7001', 'NALUオンライン', 'b7101', 'オンラインリモート', '7027', 'FALSE', '', '', ''],
    ['NALUオンライン', 'a7001', 'NALUオンライン', 'b7101', 'オンラインLepton', '7028', 'FALSE', '', '', ''],
    ['NALUオンライン', 'a7001', 'NALUオンライン', 'b7101', 'オンライン東京', '7011', 'FALSE', '', '', ''],
    ['NALUオンライン', 'a7001', 'NALUオンライン', 'b7101', 'オンライン福岡', '7021', 'FALSE', '', '', ''],
    ['NALUオンライン', 'a7001', 'NALUオンライン', 'b7101', 'オンライン九州', '7041', 'FALSE', '', '', ''],
    ['NALUオンライン', 'a7001', 'NALUオンライン', 'b7101', 'オンライン中四国', '7031', 'FALSE', '', '', ''],
    ['NALUオンライン', 'a7001', 'NALUオンライン', 'b7101', 'SALTZ FC', '8101', 'FALSE', '', '', ''],
    ['NALUオンライン', 'a7001', 'NALUオンライン', 'b7101', 'アンジュヴィオレ', '8102', 'FALSE', '', '', ''],
    ['本部', 'a9900', '本部', 'b9900', '進学教室', '9802', 'FALSE', '', '', ''],
    ['本部', 'a9900', '本部', 'b9900', '管理C(平尾)', '9901', 'FALSE', '', '', ''],
    ['本部', 'a9900', '本部', 'b9900', '薬院本部', '9903', 'FALSE', '', '', ''],
    ['本部', 'a9900', '本部', 'b9900', '薬院ＣＣ', '9902', 'FALSE', '', '', ''],
    ['本部', 'a9900', '本部', 'b9900', 'イベント', '9800', 'FALSE', '', '', ''],
    ['本部', 'a9900', '本部', 'b9900', '会場', '9001', 'FALSE', '', '', ''],
    ['本部', 'a9900', '本部', 'b9900', 'リモート', '9803', 'FALSE', '', '', ''],
    ['本部', 'a9900', '本部', 'b9900', '体験会', '9811', 'FALSE', '', '', ''],
    ['本部', 'a9900', '本部', 'b9900', '研修', '9990', 'FALSE']
  ]
};

LCT.UNIT.baseOrder = LCT.UNIT.baseNXTData.body.reduce((obj, item, index) => {
  obj[item[4]] = index;
  return obj;
}, {});

LCT.UNIT.blockname = {
  a5011: '関東',
  a5021: '福岡',
  a5022: '九州西',
  a5023: '九州西',
  a5024: '福岡',
  a5025: '九州南',
  a5031: '中四国',
  a5032: '旧中四国東',
  a7001: 'オンライン',
  a7004: 'NALU',
  a8001: 'みらいミッテ',
  a9900: '本部'
};
LCT.UNIT.blockOrder = {};
Object.keys(LCT.UNIT.blockname).forEach((id, index) => {
  LCT.UNIT.blockOrder[LCT.UNIT.blockname[id]] = index;
});
//ネッツの基本データベース
LCT.NETZ = {};
LCT.NETZ.classTime = [
  { fig: '①', start: '11:00' },
  { fig: '②', start: '11:50' },
  { fig: '③', start: '12:40' },
  { fig: '④', start: '13:30' },
  { fig: '⑤', start: '14:20' },
  { fig: '⑥', start: '15:10' },
  { fig: '⑦', start: '16:00' },
  { fig: '⑧', start: '16:50' },
  { fig: '⑨', start: '17:40' },
  { fig: '⑩', start: '18:30' },
  { fig: '⑪', start: '19:20' },
  { fig: '⑫', start: '20:10' },
  { fig: '⑬', start: '21:00' }
];
//生徒関係のデータベース
LCT.STUDENT = {};
//NMの学年番号
LCT.STUDENT.gradeTable = {
  小学生: 10,
  中学生: 20,
  高校生: 30,
  受験小: 60,
  一貫中: 70,
  小１: 11,
  小２: 12,
  小３: 13,
  小４: 14,
  小５: 15,
  小６: 16,
  中１: 21,
  中２: 22,
  中３: 23,
  高校受験: 28,
  高１: 31,
  高２: 32,
  高３: 33,
  大学受験: 38,
  受験小１: 61,
  受験小２: 62,
  受験小３: 63,
  受験小４: 64,
  受験小５: 65,
  受験小６: 66,
  一貫中１: 71,
  一貫中２: 72,
  一貫中３: 73,
  幼児０歳: 80,
  幼児１歳: 81,
  幼児２歳: 82,
  幼児３歳: 83,
  年少４歳: 84,
  年中５歳: 85,
  年長６歳: 86,
  未就学: 91,
  その他: 99
};
//講師関係データベース
LCT.TEACHER = {};
LCT.TEACHER.empNXTData = {
  head: ['cd', 'name', 'kana', 'retire'],
  body: [
    ['000001', '紀洲　良彦', 'キシュウ　ヨシヒコ'],
    ['000005', '松本　允', 'マツモト　アタル'],
    ['000006', '横尾　昇平', 'ヨコオ　ショウヘイ'],
    ['000008', '杉浦　章', 'スギウラ　アキラ'],
    ['000009', '菊原　潤一', 'キクハラ　ジュンイチ'],
    ['000010', '真方　貴史', 'マカタ　タカフミ'],
    ['000013', '長谷川　実', 'ハセガワ　ミノル'],
    ['000015', '今別府　理沙', 'イマベップ　リサ'],
    ['000023', '松尾　眞二郎', 'マツオ　シンジロウ'],
    ['000024', '米田　美奈', 'ヨネダ　ミナ'],
    ['000027', '田尻　貴之', 'タジリ　タカユキ'],
    ['000029', '永安　希', 'ナガヤス　ノゾミ'],
    ['000036', '中尾　英雄', 'ナカオ　ヒデオ'],
    ['000044', '藤原　恵', 'フジワラ　メグミ'],
    ['000049', '渡部　英二', 'ワタベ　エイジ'],
    ['000054', '斉藤　敬重', 'サイトウ　タカシゲ'],
    ['000061', '十島　洋一郎', 'トシマ　ヨウイチロウ'],
    ['000063', '岡田　絵利香', 'オカダ　エリカ'],
    ['000065', '長谷川　仁', 'ハセガワ　ジン'],
    ['000067', '山本　博文', 'ヤマモト　ヒロフミ'],
    ['000068', '新田　晃史', 'ニッタ　アキフミ'],
    ['000070', '大楠　正尚', 'オオクス　マサナオ'],
    ['000071', '桝見　英理', 'マスミ　エリ'],
    ['000072', '猿谷　博史', 'サルヤ　ヒロシ'],
    ['000073', '大城　拓也', 'オオシロ　タクヤ'],
    ['000074', '庄野　知佳', 'ショウノ　チカ'],
    ['000079', '川中　文子', 'カワナカ　フミコ'],
    ['000080', '登立　晃史', 'ノボリタテ　コウジ'],
    ['000081', '岩永　梓', 'イワナガ　アズサ'],
    ['000087', '萩原　崇宏', 'ハギワラ　タカヒロ'],
    ['000090', '四通　友子', 'ヨトオリ　トモコ'],
    ['000095', '深見　太郎', 'フカミ　タロウ'],
    ['000102', '重藤　結', 'シゲフジ　ユウ'],
    ['000103', '渡邊　祐理', 'ワタナベ ユウリ'],
    ['000108', '長谷場　康平', 'ハセバ　コウヘイ'],
    ['000111', '澄川　愛', 'スミカワ　アイ'],
    ['000117', '内野　涼樹', 'ウチノ　スズキ'],
    ['000120', '末長　和将', 'スエナガ　カズマサ'],
    ['000139', '西原　啓輔', 'ニシハラ　ケイスケ'],
    ['000146', '島田　晃輔', 'シマダ　コウスケ'],
    ['000149', '坂本　薫', 'サカモト　カオル'],
    ['000150', '中上　隼人', 'ナカガミ　ハヤト'],
    ['000152', '池田　さくら', 'イケダ　サクラ'],
    ['000161', '綿野　孝政', 'ワタノ　タカマサ'],
    ['000163', '花園　祐典', 'ハナゾノ　ユウスケ'],
    ['000171', '日下部　桜子', 'クサカベ　サクラコ'],
    ['000183', '伊東　孝峻', 'イトウ　タカトシ'],
    ['000185', '木下　将孝', 'キノシタ　マサタカ'],
    ['000186', '中野　克哉', 'ナカノ　カツヤ'],
    ['000190', '伊藤　千夏', 'イトウ　チカ'],
    ['000192', '竹中　香保里', 'タケナカ　カホリ'],
    ['000194', '廣戸　梨菜', 'ヒロト　リナ'],
    ['000199', '佐々木　譲司', 'ササキ　ジョウジ'],
    ['000203', '藤井　俊輔', 'フジイ　シュンスケ'],
    ['000224', '森田　栞', 'モリタ　シオリ'],
    ['000225', '丸山　暢介', 'マルヤマ　ノブスケ'],
    ['000230', '末廣　昇吾', 'スエヒロ　ショウゴ'],
    ['000231', '辰野　由弥', 'タツノ　ユウヤ'],
    ['000233', '手柴　智史', 'テシバ　サトシ'],
    ['000235', '古川　泰治', 'フルカワ　タイチ'],
    ['000249', '鹿毛　史寛', 'カゲ　フミヒロ'],
    ['000262', '矢野　誠治', 'ヤノ　セイジ'],
    ['000275', '田中　航', 'タナカ　ワタル'],
    ['000281', '平岡　沙希子', 'ヒラオカ　サキコ'],
    ['000284', '松本　直樹', 'マツモト　ナオキ'],
    ['000290', '柿元　秀彰', 'カキモト　ヒデアキ'],
    ['000292', '大世戸　敦', 'オオセド　アツシ'],
    ['000296', '田原　晃希', 'タハラ　コウキ'],
    ['000298', '中島　和洋', 'ナカシマ　カズヒロ'],
    ['000299', '中山　愛咲子', 'ナカヤマ　アサコ'],
    ['000307', '星原　啓佑', 'ホシハラ　ケイスケ'],
    ['000313', '奥西　希琳', 'オクニシ　キリン'],
    ['000317', '清水　佑紀', 'シミズ　ユウキ'],
    ['000321', '宮薗　直人', 'ミヤゾノ　ナオト'],
    ['000323', '山口　智也', 'ヤマグチ　トモヤ'],
    ['000325', '中村　正史', 'ナカムラ　マサフミ'],
    ['000326', '大橋　健司', 'オオハシ　ツヨシ'],
    ['000330', '土屋　佑太郎', 'ツチヤ　ユウタロウ'],
    ['000337', '福成　和', 'フクナリ　イズミ'],
    ['000343', '池田　光一', 'イケダ　コウイチ'],
    ['000344', '梅野　優人', 'ウメノ　ユウト'],
    ['000348', '清水　幸大', 'シミズ　コウダイ'],
    ['000350', '浜田　健登', 'ハマダ　ケント'],
    ['000356', '嶋田　仁', 'シマダ　ヒトシ'],
    ['000360', '北原　弘大', 'キタハラ　コウダイ'],
    ['000363', '久木　志穂', 'ヒサキ　シホ'],
    ['000365', '伊賀　宏幸', 'イガ　ヒロユキ'],
    ['000366', '山口　美佳', 'ヤマグチ　ミカ'],
    ['000368', '大田　俊介', 'オオタ　シュンスケ'],
    ['000369', '大山　椋平', 'オオヤマ　リョウヘイ'],
    ['000372', '眞崎　由梨佳', 'マサキ　ユリカ'],
    ['000373', '河野　泰弦', 'カワノ　タイゲン'],
    ['000376', '古久保　和仁', 'フルクボ　カズヒト'],
    ['000377', '奥山　祥之', 'オクヤマ　ヨシユキ'],
    ['000379', '谷口　正法', 'タニグチ　マサノリ'],
    ['000380', '村上　恒樹', 'ムラカミ　コウキ'],
    ['000381', '渡辺　悠介', 'ワタナベ　ユウスケ'],
    ['000382', '内村　太貴', 'ウチムラ　タイキ'],
    ['000383', '川崎　智也', 'カワサキ　トモヤ'],
    ['000384', '久野瀬　珠季', 'クノセ　タマキ'],
    ['000385', '山本　真由', 'ヤマモト　マユ'],
    ['000387', '平本　晃大', 'ヒラモト　コウタ'],
    ['000388', '江夏　孝梓', 'エナツ　タカシ'],
    ['000389', '鈴木　理桜', 'スズキ　リオ'],
    ['000390', '富川　健世', 'トミカワ　ケンセイ'],
    ['000391', '安永　和弘', 'ヤスナガ　カズヒロ'],
    ['000392', '堤　拓真', 'ツツミ　タクマ'],
    ['000393', '原田　啓史', 'ハラダ　ケイシ'],
    ['000394', '前田　將貴', 'マエダ　マサタカ'],
    ['000395', '上谷　徳臣', 'ウエタニ　アツミ'],
    ['000396', '中村　莉菜', 'ナカムラ　リナ'],
    ['115452', '那須　裕子', 'ナス　ヒロコ']
  ]
};

LCT.TEACHER.emplist = {
  '000001': { cd: '000001', name: '紀洲　良彦', kana: 'キシュウ　ヨシヒコ' },
  '000005': { cd: '000005', name: '松本　允', kana: 'マツモト　アタル' },
  '000006': { cd: '000006', name: '横尾　昇平', kana: 'ヨコオ　ショウヘイ' },
  '000008': { cd: '000008', name: '杉浦　章', kana: 'スギウラ　アキラ' },
  '000009': { cd: '000009', name: '菊原　潤一', kana: 'キクハラ　ジュンイチ' },
  '000010': { cd: '000010', name: '真方　貴史', kana: 'マカタ　タカフミ' },
  '000013': { cd: '000013', name: '長谷川　実', kana: 'ハセガワ　ミノル' },
  '000015': { cd: '000015', name: '今別府　理沙', kana: 'イマベップ　リサ' },
  '000023': { cd: '000023', name: '松尾　眞二郎', kana: 'マツオ　シンジロウ' },
  '000024': { cd: '000024', name: '米田　美奈', kana: 'ヨネダ　ミナ' },
  '000027': { cd: '000027', name: '田尻　貴之', kana: 'タジリ　タカユキ' },
  '000029': { cd: '000029', name: '永安　希', kana: 'ナガヤス　ノゾミ' },
  '000036': { cd: '000036', name: '中尾　英雄', kana: 'ナカオ　ヒデオ' },
  '000044': { cd: '000044', name: '藤原　恵', kana: 'フジワラ　メグミ' },
  '000049': { cd: '000049', name: '渡部　英二', kana: 'ワタベ　エイジ' },
  '000054': { cd: '000054', name: '斉藤　敬重', kana: 'サイトウ　タカシゲ' },
  '000061': { cd: '000061', name: '十島　洋一郎', kana: 'トシマ　ヨウイチロウ' },
  '000063': { cd: '000063', name: '岡田　絵利香', kana: 'オカダ　エリカ' },
  '000065': { cd: '000065', name: '長谷川　仁', kana: 'ハセガワ　ジン' },
  '000067': { cd: '000067', name: '山本　博文', kana: 'ヤマモト　ヒロフミ' },
  '000068': { cd: '000068', name: '新田　晃史', kana: 'ニッタ　アキフミ' },
  '000070': { cd: '000070', name: '大楠　正尚', kana: 'オオクス　マサナオ' },
  '000071': { cd: '000071', name: '桝見　英理', kana: 'マスミ　エリ' },
  '000072': { cd: '000072', name: '猿谷　博史', kana: 'サルヤ　ヒロシ' },
  '000073': { cd: '000073', name: '大城　拓也', kana: 'オオシロ　タクヤ' },
  '000074': { cd: '000074', name: '庄野　知佳', kana: 'ショウノ　チカ' },
  '000079': { cd: '000079', name: '川中　文子', kana: 'カワナカ　フミコ' },
  '000080': { cd: '000080', name: '登立　晃史', kana: 'ノボリタテ　コウジ' },
  '000081': { cd: '000081', name: '岩永　梓', kana: 'イワナガ　アズサ' },
  '000087': { cd: '000087', name: '萩原　崇宏', kana: 'ハギワラ　タカヒロ' },
  '000090': { cd: '000090', name: '四通　友子', kana: 'ヨトオリ　トモコ' },
  '000095': { cd: '000095', name: '深見　太郎', kana: 'フカミ　タロウ' },
  '000102': { cd: '000102', name: '重藤　結', kana: 'シゲフジ　ユウ' },
  '000103': { cd: '000103', name: '渡邊　祐理', kana: 'ワタナベ ユウリ' },
  '000108': { cd: '000108', name: '長谷場　康平', kana: 'ハセバ　コウヘイ' },
  '000111': { cd: '000111', name: '澄川　愛', kana: 'スミカワ　アイ' },
  '000117': { cd: '000117', name: '内野　涼樹', kana: 'ウチノ　スズキ' },
  '000120': { cd: '000120', name: '末長　和将', kana: 'スエナガ　カズマサ' },
  '000139': { cd: '000139', name: '西原　啓輔', kana: 'ニシハラ　ケイスケ' },
  '000146': { cd: '000146', name: '島田　晃輔', kana: 'シマダ　コウスケ' },
  '000149': { cd: '000149', name: '坂本　薫', kana: 'サカモト　カオル' },
  '000150': { cd: '000150', name: '中上　隼人', kana: 'ナカガミ　ハヤト' },
  '000152': { cd: '000152', name: '池田　さくら', kana: 'イケダ　サクラ' },
  '000161': { cd: '000161', name: '綿野　孝政', kana: 'ワタノ　タカマサ' },
  '000163': { cd: '000163', name: '花園　祐典', kana: 'ハナゾノ　ユウスケ' },
  '000171': { cd: '000171', name: '日下部　桜子', kana: 'クサカベ　サクラコ' },
  '000183': { cd: '000183', name: '伊東　孝峻', kana: 'イトウ　タカトシ' },
  '000185': { cd: '000185', name: '木下　将孝', kana: 'ｷﾉｼﾀ ﾏｻﾀｶ' },
  '000186': { cd: '000186', name: '中野　克哉', kana: 'ナカノ　カツヤ' },
  '000190': { cd: '000190', name: '伊藤　千夏', kana: 'イトウ　チカ' },
  '000192': { cd: '000192', name: '竹中　香保里', kana: 'タケナカ　カホリ' },
  '000194': { cd: '000194', name: '廣戸　梨菜', kana: 'ヒロト　リナ' },
  '000199': { cd: '000199', name: '佐々木　譲司', kana: 'ササキ　ジョウジ' },
  '000203': { cd: '000203', name: '藤井　俊輔', kana: 'フジイ　シュンスケ' },
  '000224': { cd: '000224', name: '森田　栞', kana: 'モリタ　シオリ' },
  '000225': { cd: '000225', name: '丸山　暢介', kana: 'マルヤマ　ノブスケ' },
  '000230': { cd: '000230', name: '末廣　昇吾', kana: 'スエヒロ　ショウゴ' },
  '000231': { cd: '000231', name: '辰野　由弥', kana: 'タツノ　ユウヤ' },
  '000233': { cd: '000233', name: '手柴　智史', kana: 'テシバ　サトシ' },
  '000235': { cd: '000235', name: '古川　泰治', kana: 'フルカワ　タイチ' },
  '000249': { cd: '000249', name: '鹿毛　史寛', kana: 'カゲ　フミヒロ' },
  '000262': { cd: '000262', name: '矢野　誠治', kana: 'ヤノ　セイジ' },
  '000275': { cd: '000275', name: '田中　航', kana: 'タナカ　ワタル' },
  '000281': { cd: '000281', name: '平岡　沙希子', kana: 'ヒラオカ　サキコ' },
  '000284': { cd: '000284', name: '松本　直樹', kana: 'マツモト　ナオキ' },
  '000290': { cd: '000290', name: '柿元　秀彰', kana: 'カキモト　ヒデアキ' },
  '000292': { cd: '000292', name: '大世戸　敦', kana: 'オオセド　アツシ' },
  '000296': { cd: '000296', name: '田原　晃希', kana: 'タハラ　コウキ' },
  '000298': { cd: '000298', name: '中島　和洋', kana: 'ナカシマ　カズヒロ' },
  '000299': { cd: '000299', name: '中山　愛咲子', kana: 'ナカヤマ　アサコ' },
  '000307': { cd: '000307', name: '星原　啓佑', kana: 'ホシハラ　ケイスケ' },
  '000313': { cd: '000313', name: '奥西　希琳', kana: 'オクニシ　キリン' },
  '000317': { cd: '000317', name: '清水　佑紀', kana: 'シミズ　ユウキ' },
  '000321': { cd: '000321', name: '宮薗　直人', kana: 'ミヤゾノ　ナオト' },
  '000323': { cd: '000323', name: '山口　智也', kana: 'ヤマグチ　トモヤ' },
  '000325': { cd: '000325', name: '中村　正史', kana: 'ナカムラ　マサフミ' },
  '000326': { cd: '000326', name: '大橋　健司', kana: 'オオハシ　ツヨシ' },
  '000330': { cd: '000330', name: '土屋　佑太郎', kana: 'ツチヤ　ユウタロウ' },
  '000337': { cd: '000337', name: '福成　和', kana: 'フクナリ　イズミ' },
  '000343': { cd: '000343', name: '池田　光一', kana: 'イケダ　コウイチ' },
  '000344': { cd: '000344', name: '梅野　優人', kana: 'ウメノ　ユウト' },
  '000348': { cd: '000348', name: '清水　幸大', kana: 'シミズ　コウダイ' },
  '000350': { cd: '000350', name: '浜田　健登', kana: 'ハマダ　ケント' },
  '000356': { cd: '000356', name: '嶋田　仁', kana: 'シマダ　ヒトシ' },
  '000360': { cd: '000360', name: '北原　弘大', kana: 'キタハラ　コウダイ' },
  '000363': { cd: '000363', name: '久木　志穂', kana: 'ヒサキ　シホ' },
  '000365': { cd: '000365', name: '伊賀　宏幸', kana: 'イガ　ヒロユキ' },
  '000366': { cd: '000366', name: '山口　美佳', kana: 'ヤマグチ　ミカ' },
  '000368': { cd: '000368', name: '大田　俊介', kana: 'オオタ　シュンスケ' },
  '000369': { cd: '000369', name: '大山　椋平', kana: 'オオヤマ　リョウヘイ' },
  '000372': { cd: '000372', name: '眞崎　由梨佳', kana: 'マサキ　ユリカ' },
  '000373': { cd: '000373', name: '河野　泰弦', kana: 'カワノ　タイゲン' },
  '000376': { cd: '000376', name: '古久保　和仁', kana: 'フルクボ　カズヒト' },
  '000377': { cd: '000377', name: '奥山　祥之', kana: 'オクヤマ　ヨシユキ' },
  '000379': { cd: '000379', name: '谷口　正法', kana: 'タニグチ マサノリ' },
  '000380': { cd: '000380', name: '村上　恒樹', kana: 'ムラカミ コウキ' },
  '000381': { cd: '000381', name: '渡辺　悠介', kana: 'ワタナベ　ユウスケ' },
  '000382': { cd: '000382', name: '内村　太貴', kana: 'ウチムラ　タイキ' },
  '000383': { cd: '000383', name: '川崎　智也', kana: 'カワサキ　トモヤ' },
  '000384': { cd: '000384', name: '久野瀬　珠季', kana: 'クノセ　タマキ' },
  '000385': { cd: '000385', name: '山本　真由', kana: 'ヤマモト　マユ' },
  '115452': { cd: '115452', name: '那須　裕子', kana: '那須　裕子' },
  '000387': { cd: '000387', name: '平本　晃大', kana: '平本　晃大' }
};
//オリジナルの集団を作る
LCT.TEACHER.class = {
  '!中四国B': ['000108', '000152', '000231'],
  '!教務': ['000029', '000074', '000231'],
  '!本部': ['000044', '000054', '000071', '000146', '000231', '000325'],
  '!中四国高校生': ['000231', '000343', '000376', '000387']
};
//問い合わせ関連のデータベース
LCT.INQ = {};
LCT.INQ.phonegroup = {
  5: {
    '01267': 1,
    '01372': 1,
    '01374': 1,
    '01377': 1,
    '01392': 1,
    '01397': 1,
    '01398': 1,
    '01456': 1,
    '01457': 1,
    '01466': 1,
    '01547': 1,
    '01558': 1,
    '01564': 1,
    '01586': 1,
    '01587': 1,
    '01632': 1,
    '01634': 1,
    '01635': 1,
    '01648': 1,
    '01654': 1,
    '01655': 1,
    '01656': 1,
    '01658': 1,
    '04992': 1,
    '04994': 1,
    '04996': 1,
    '04998': 1,
    '05769': 1,
    '05979': 1,
    '07468': 1,
    '08387': 1,
    '08388': 1,
    '08396': 1,
    '08477': 1,
    '08512': 1,
    '08514': 1,
    '09496': 1,
    '09802': 1,
    '09912': 1,
    '09913': 1,
    '09969': 1
  },
  4: {
    '0123': 2,
    '0124': 2,
    '0125': 2,
    '0126': 2,
    '0133': 2,
    '0134': 2,
    '0135': 2,
    '0136': 2,
    '0137': 2,
    '0138': 2,
    '0139': 2,
    '0142': 2,
    '0143': 2,
    '0144': 2,
    '0145': 2,
    '0146': 2,
    '0152': 2,
    '0153': 2,
    '0154': 2,
    '0155': 2,
    '0156': 2,
    '0157': 2,
    '0158': 2,
    '0162': 2,
    '0163': 2,
    '0164': 2,
    '0165': 2,
    '0166': 2,
    '0167': 2,
    '0172': 2,
    '0173': 2,
    '0174': 2,
    '0175': 2,
    '0176': 2,
    '0178': 2,
    '0179': 2,
    '0182': 2,
    '0183': 2,
    '0184': 2,
    '0185': 2,
    '0186': 2,
    '0187': 2,
    '0191': 2,
    '0192': 2,
    '0193': 2,
    '0194': 2,
    '0195': 2,
    '0197': 2,
    '0198': 2,
    '0220': 2,
    '0223': 2,
    '0224': 2,
    '0225': 2,
    '0226': 2,
    '0228': 2,
    '0229': 2,
    '0233': 2,
    '0234': 2,
    '0235': 2,
    '0237': 2,
    '0238': 2,
    '0240': 2,
    '0241': 2,
    '0242': 2,
    '0243': 2,
    '0244': 2,
    '0246': 2,
    '0247': 2,
    '0248': 2,
    '0250': 2,
    '0254': 2,
    '0255': 2,
    '0256': 2,
    '0257': 2,
    '0258': 2,
    '0259': 2,
    '0260': 2,
    '0261': 2,
    '0263': 2,
    '0264': 2,
    '0265': 2,
    '0266': 2,
    '0267': 2,
    '0268': 2,
    '0269': 2,
    '0270': 2,
    '0274': 2,
    '0276': 2,
    '0277': 2,
    '0278': 2,
    '0279': 2,
    '0280': 2,
    '0282': 2,
    '0283': 2,
    '0284': 2,
    '0285': 2,
    '0287': 2,
    '0288': 2,
    '0289': 2,
    '0291': 2,
    '0293': 2,
    '0294': 2,
    '0295': 2,
    '0296': 2,
    '0297': 2,
    '0299': 2,
    '0422': 2,
    '0428': 2,
    '0436': 2,
    '0438': 2,
    '0439': 2,
    '0460': 2,
    '0463': 2,
    '0465': 2,
    '0466': 2,
    '0467': 2,
    '0470': 2,
    '0475': 2,
    '0476': 2,
    '0478': 2,
    '0479': 2,
    '0480': 2,
    '0493': 2,
    '0494': 2,
    '0495': 2,
    '0531': 2,
    '0532': 2,
    '0533': 2,
    '0536': 2,
    '0537': 2,
    '0538': 2,
    '0539': 2,
    '0544': 2,
    '0545': 2,
    '0547': 2,
    '0548': 2,
    '0550': 2,
    '0551': 2,
    '0553': 2,
    '0554': 2,
    '0555': 2,
    '0556': 2,
    '0557': 2,
    '0558': 2,
    '0561': 2,
    '0562': 2,
    '0563': 2,
    '0564': 2,
    '0565': 2,
    '0566': 2,
    '0567': 2,
    '0568': 2,
    '0569': 2,
    '0572': 2,
    '0573': 2,
    '0574': 2,
    '0575': 2,
    '0576': 2,
    '0577': 2,
    '0578': 2,
    '0581': 2,
    '0584': 2,
    '0585': 2,
    '0586': 2,
    '0587': 2,
    '0594': 2,
    '0595': 2,
    '0596': 2,
    '0597': 2,
    '0598': 2,
    '0599': 2,
    '0721': 2,
    '0725': 2,
    '0735': 2,
    '0736': 2,
    '0737': 2,
    '0738': 2,
    '0739': 2,
    '0740': 2,
    '0742': 2,
    '0743': 2,
    '0744': 2,
    '0745': 2,
    '0746': 2,
    '0747': 2,
    '0748': 2,
    '0749': 2,
    '0761': 2,
    '0763': 2,
    '0765': 2,
    '0766': 2,
    '0767': 2,
    '0768': 2,
    '0770': 2,
    '0771': 2,
    '0772': 2,
    '0773': 2,
    '0774': 2,
    '0776': 2,
    '0778': 2,
    '0779': 2,
    '0790': 2,
    '0791': 2,
    '0794': 2,
    '0795': 2,
    '0796': 2,
    '0797': 2,
    '0798': 2,
    '0799': 2,
    '0820': 2,
    '0823': 2,
    '0824': 2,
    '0826': 2,
    '0827': 2,
    '0829': 2,
    '0833': 2,
    '0834': 2,
    '0835': 2,
    '0836': 2,
    '0837': 2,
    '0838': 2,
    '0845': 2,
    '0846': 2,
    '0847': 2,
    '0848': 2,
    '0852': 2,
    '0853': 2,
    '0854': 2,
    '0855': 2,
    '0856': 2,
    '0857': 2,
    '0858': 2,
    '0859': 2,
    '0863': 2,
    '0865': 2,
    '0866': 2,
    '0867': 2,
    '0868': 2,
    '0869': 2,
    '0875': 2,
    '0877': 2,
    '0879': 2,
    '0880': 2,
    '0883': 2,
    '0884': 2,
    '0885': 2,
    '0887': 2,
    '0889': 2,
    '0892': 2,
    '0893': 2,
    '0894': 2,
    '0895': 2,
    '0896': 2,
    '0897': 2,
    '0898': 2,
    '0920': 2,
    '0930': 2,
    '0940': 2,
    '0942': 2,
    '0943': 2,
    '0944': 2,
    '0946': 2,
    '0947': 2,
    '0948': 2,
    '0949': 2,
    '0950': 2,
    '0952': 2,
    '0954': 2,
    '0955': 2,
    '0956': 2,
    '0957': 2,
    '0959': 2,
    '0964': 2,
    '0965': 2,
    '0966': 2,
    '0967': 2,
    '0968': 2,
    '0969': 2,
    '0972': 2,
    '0973': 2,
    '0974': 2,
    '0977': 2,
    '0978': 2,
    '0979': 2,
    '0980': 2,
    '0982': 2,
    '0983': 2,
    '0984': 2,
    '0985': 2,
    '0986': 2,
    '0987': 2,
    '0993': 2,
    '0994': 2,
    '0995': 2,
    '0996': 2,
    '0997': 2,
    '0180': 3,
    '0570': 3,
    '0800': 3,
    '0990': 3,
    '0120': 3
  },
  3: {
    '011': 3,
    '015': 3,
    '017': 3,
    '018': 3,
    '019': 3,
    '022': 3,
    '023': 3,
    '024': 3,
    '025': 3,
    '026': 3,
    '027': 3,
    '028': 3,
    '029': 3,
    '042': 3,
    '043': 3,
    '044': 3,
    '045': 3,
    '046': 3,
    '047': 3,
    '048': 3,
    '049': 3,
    '052': 3,
    '053': 3,
    '054': 3,
    '055': 3,
    '058': 3,
    '059': 3,
    '072': 3,
    '073': 3,
    '075': 3,
    '076': 3,
    '077': 3,
    '078': 3,
    '079': 3,
    '082': 3,
    '083': 3,
    '084': 3,
    '086': 3,
    '087': 3,
    '088': 3,
    '089': 3,
    '092': 3,
    '093': 3,
    '095': 3,
    '096': 3,
    '097': 3,
    '098': 3,
    '099': 3,
    '050': 4,
    '020': 4,
    '070': 4,
    '080': 4,
    '090': 4
  },
  2: {
    '03': 4,
    '04': 4,
    '06': 4
  }
};
//学校情報データベース
LCT.SCHOOL = {};
LCT.SCHOOL.hiroshima = {
  国泰寺高校普通科: {
    NMname: '国泰寺高校',
    department: '普通科',
    region: '中区',
    administrator: '市立',
    class: '公立',
    SS: 62
  },
  国泰寺高校普通科理数コース: {
    NMname: '国泰寺高校',
    department: '普通科理数コース',
    region: '中区',
    administrator: '市立',
    class: '公立',
    SS: 62
  },
  基町高校普通科: {
    NMname: '基町高校',
    department: '普通科',
    region: '中区',
    administrator: '市立',
    class: '公立',
    SS: 69
  },
  基町高校普通科創造表現コース: {
    NMname: '基町高校',
    department: '普通科創造表現コース',
    region: '中区',
    administrator: '市立',
    class: '公立',
    SS: 60
  },
  舟入高校普通科: {
    NMname: '舟入高校',
    department: '普通科',
    region: '中区',
    administrator: '市立',
    class: '公立',
    SS: 65
  },
  舟入高校普通科国際コミュニケーションコース: {
    NMname: '舟入高校',
    department: '普通科国際コミュニケーションコース',
    region: '中区',
    administrator: '市立',
    class: '公立',
    SS: 58
  },
  県立広島商業高校: {
    NMname: '県立広島商業高校',
    department: '',
    region: '中区',
    administrator: '県立',
    class: '公立',
    SS: ''
  },
  市立広島商業高校: {
    NMname: '市立広島商業高校',
    department: '',
    region: '東区',
    administrator: '市立',
    class: '公立',
    SS: ''
  },
  皆実高校普通科: {
    NMname: '皆実高校',
    department: '普通科',
    region: '南区',
    administrator: '県立',
    class: '公立',
    SS: 59
  },
  皆実高校衛生看護科: {
    NMname: '皆実高校',
    department: '衛生看護科',
    region: '南区',
    administrator: '県立',
    class: '公立',
    SS: 56
  },
  皆実高校体育科: {
    NMname: '皆実高校',
    department: '体育科',
    region: '南区',
    administrator: '県立',
    class: '公立',
    SS: 44
  },
  県立広島工業高校: {
    NMname: '県立広島工業高校',
    department: '',
    region: '南区',
    administrator: '県立',
    class: '公立',
    SS: ''
  },
  市立広島工業高校: {
    NMname: '市立広島工業高校',
    department: '',
    region: '南区',
    administrator: '市立',
    class: '公立',
    SS: ''
  },
  井口高校: {
    NMname: '井口高校',
    department: '',
    region: '西区',
    administrator: '県立',
    class: '公立',
    SS: ''
  },
  観音高校: {
    NMname: '観音高校',
    department: '',
    region: '西区',
    administrator: '県立',
    class: '公立',
    SS: ''
  },
  安古市高校: {
    NMname: '安古市高校',
    department: '',
    region: '安佐南区',
    administrator: '県立',
    class: '公立',
    SS: ''
  },
  安西高校: {
    NMname: '安西高校',
    department: '',
    region: '安佐南区',
    administrator: '県立',
    class: '公立',
    SS: ''
  },
  祇園北高校: {
    NMname: '祇園北高校',
    department: '',
    region: '安佐南区',
    administrator: '県立',
    class: '公立',
    SS: ''
  },
  沼田高校: {
    NMname: '沼田高校',
    department: '',
    region: '安佐南区',
    administrator: '市立',
    class: '公立',
    SS: ''
  },
  可部高校: {
    NMname: '可部高校',
    department: '',
    region: '安佐北区',
    administrator: '県立',
    class: '公立',
    SS: ''
  },
  高陽高校: {
    NMname: '高陽高校',
    department: '',
    region: '安佐北区',
    administrator: '県立',
    class: '公立',
    SS: ''
  },
  高陽東高校: {
    NMname: '高陽東高校',
    department: '',
    region: '安佐北区',
    administrator: '県立',
    class: '公立',
    SS: ''
  },
  安芸南高校: {
    NMname: '安芸南高校',
    department: '',
    region: '安芸区',
    administrator: '県立',
    class: '公立',
    SS: ''
  },
  五日市高校: {
    NMname: '五日市高校',
    department: '',
    region: '佐伯区',
    administrator: '県立',
    class: '公立',
    SS: ''
  },
  美鈴が丘高校: {
    NMname: '美鈴が丘高校',
    department: '',
    region: '佐伯区',
    administrator: '県立',
    class: '公立',
    SS: ''
  },
  賀茂高校: {
    NMname: '賀茂高校',
    department: '',
    region: '東広島市',
    administrator: '県立',
    class: '公立',
    SS: ''
  },
  西条農業高校: {
    NMname: '西条農業高校',
    department: '',
    region: '東広島市',
    administrator: '県立',
    class: '公立',
    SS: ''
  },
  廿日市高校: {
    NMname: '廿日市高校',
    department: '',
    region: '廿日市市',
    administrator: '県立',
    class: '公立',
    SS: ''
  },
  廿日市西高校: {
    NMname: '廿日市西高校',
    department: '',
    region: '廿日市市',
    administrator: '県立',
    class: '公立',
    SS: ''
  },
  宮島工業高校: {
    NMname: '宮島工業高校',
    department: '',
    region: '廿日市市',
    administrator: '県立',
    class: '公立',
    SS: ''
  },
  安芸府中高校: {
    NMname: '安芸府中高校',
    department: '',
    region: '安芸郡',
    administrator: '県立',
    class: '公立',
    SS: ''
  },
  海田高校: {
    NMname: '海田高校',
    department: '',
    region: '安芸郡',
    administrator: '県立',
    class: '公立',
    SS: ''
  },
  安田女子高校: {
    NMname: '安田女子高校',
    department: '',
    region: '中区',
    administrator: '私立',
    class: '私立',
    SS: ''
  },
  広島城北高校: {
    NMname: '広島城北高校',
    department: '',
    region: '',
    administrator: '私立',
    class: '私立',
    SS: ''
  },
  瀬戸内高校: {
    NMname: '瀬戸内高校',
    department: '',
    region: '',
    administrator: '私立',
    class: '私立',
    SS: ''
  },
  桜が丘高校: {
    NMname: '桜が丘高校',
    department: '',
    region: '',
    administrator: '私立',
    class: '私立',
    SS: ''
  },
  広島大学附属高校: {
    NMname: '広島大学附属高校',
    department: '',
    region: '',
    administrator: '私立',
    class: '私立',
    SS: ''
  },
  比治山女子高校: {
    NMname: '比治山女子高校',
    department: '',
    region: '',
    administrator: '私立',
    class: '私立',
    SS: ''
  },
  進徳女子高校: {
    NMname: '進徳女子高校',
    department: '',
    region: '',
    administrator: '私立',
    class: '私立',
    SS: ''
  },
  崇徳高校: {
    NMname: '崇徳高校',
    department: '',
    region: '',
    administrator: '私立',
    class: '私立',
    SS: ''
  },
  ひろしま協創高校: {
    NMname: 'ひろしま協創高校',
    department: '',
    region: '',
    administrator: '私立',
    class: '私立',
    SS: ''
  },
  広島工業大学高校: {
    NMname: '広島工業大学高校',
    department: '',
    region: '',
    administrator: '私立',
    class: '私立',
    SS: ''
  },
  山陽高校: {
    NMname: '山陽高校',
    department: '',
    region: '',
    administrator: '私立',
    class: '私立',
    SS: ''
  },
  広陵高校: {
    NMname: '広陵高校',
    department: '',
    region: '',
    administrator: '私立',
    class: '私立',
    SS: ''
  },
  広島文教大学附属高校: {
    NMname: '広島文教大学附属高校',
    department: '',
    region: '',
    administrator: '私立',
    class: '私立',
    SS: ''
  },
  広島なぎさ高校: {
    NMname: '広島なぎさ高校',
    department: '',
    region: '',
    administrator: '私立',
    class: '私立',
    SS: ''
  },
  山陽女学園高校: {
    NMname: '山陽女学園高校',
    department: '',
    region: '',
    administrator: '私立',
    class: '私立',
    SS: ''
  },
  近畿大学附属広島高校: {
    NMname: '近畿大学附属広島高校',
    department: '',
    region: '',
    administrator: '私立',
    class: '私立',
    SS: ''
  },
  武田高校: {
    NMname: '武田高校',
    department: '',
    region: '',
    administrator: '私立',
    class: '私立',
    SS: ''
  },
  広島国際学院高校: {
    NMname: '広島国際学院高校',
    department: '',
    region: '',
    administrator: '私立',
    class: '私立',
    SS: ''
  },
  広島翔洋高校: {
    NMname: '広島翔洋高校',
    department: '',
    region: '',
    administrator: '私立',
    class: '私立',
    SS: ''
  }
};
//メールテンプレート
/* eslint-disable no-irregular-whitespace */
LCT.TEMPLATE = {};
LCT.TEMPLATE.Teacher = {};
LCT.TEMPLATE.Teacher.testurl = `採用テストは、英語、数学の2教科あります。時間は、各教科45分です。
テスト末尾の送信ボタンを押したら受験完了です。

英語テスト
https://forms.office.com/Pages/ResponsePage.aspx?id=tUqCmPV9f0WIdtp-hcoEECIpp2uGtH1Ft3xGs1ymVxFUNE04MzdHMUFEWFhXWUxKQkNXMEEyRDVaUi4u

数学テスト
https://forms.office.com/Pages/ResponsePage.aspx?id=tUqCmPV9f0WIdtp-hcoEECIpp2uGtH1Ft3xGs1ymVxFUM0lOOFhESE1NTkpVVkJCNEk4ODFIUkRWVC4u

本日中に受験いただければと思います。
よろしくおねがいします。`;
LCT.TEMPLATE.Teacher.thankyoudetail = `アルバイトのご応募いただきありがとうございます。
早速ですが面接を行わせていただきたく、日程のご相談で連絡させていただきました。

１．面接の要項
　・現在zoomを使ったオンライン面接を実施させていただいています。
　・zoom使ったことないよ！という場合はお気軽にご質問ください。
　・時間は３０分程度を予定しています。実際の勤務に沿ってスーツでの面接になります。
２．面接可能日時
　平日は１７：００～２２：００（水曜日除く）
　土曜は１３：３０～２１：００
　が可能な時間になります。他の方との調整もございますので、いくつか候補を挙げていただければと思います。
３．その他
　その他アルバイトに関してご質問がありましたら、このメールに返信いただければ対応させていただきます。

上記３点ご確認いただき、ご返信くださいませ。
なお、スムーズな対応のため電話連絡での説明・面接日程取りも可能です。
0120-969-121よりお電話をかけさせていただきますので、ご都合がつきましたら出ていただければと思います。
タイミング上、難しいようでしたらメールでのやり取りでも構いません。`;
LCT.TEMPLATE.Teacher.mysign = `--------------------------------------
対話式進学塾１対１ネッツ
広島エリア講師面接担当
辰野　由弥
--------------------------------------
`;
LCT.TEMPLATE.Student = {};
LCT.TEMPLATE.Student.kihoninfo = `・
================================================================================================================
誕生日：●月●日
血液型：
兄弟：
【学校生活】
・苦手な教科：
・得意な教科：
・部活動：
・委員会：なし
・朝課外、朝練：
・放課後課外：
【習い事】
・
【趣味】
・
【好きなもの】
・食べ物：
・アーティスト、曲：
・有名人：
・色：
・アニメ・漫画：
・本、小説：
【面談時注意事項】
・`;
LCT.TEMPLATE.Student.future = `＜将来の夢＞

＜志望校＞
 
＜ネッツ通塾の目的＞
 
＜２０２２年の目標＞
ーーー`;
/* eslint-enable no-irregular-whitespace */
LCT.TEMPLATE.Mail = {};
LCT.TEMPLATE.Mail.AtamaAtHome = `【１対１ネッツ】atama+ご自宅利用について
お世話になります。ネッツです。

atama+は、パソコン・スマートフォン・タブレットをお持ちであればご自宅でも可能です。
以下の方法にてご利用くださいませ。

■利用方法
ブラウザにて
https://web2020.atama.plus/
にアクセスすると、ログイン画面が出てきます。
以下ログインIDとパスワードを入力してください。

ログインID：netzs生徒番号６桁（生徒番号とはIDカードに記載されている数字６桁です。※CDというアルファベットは不要です）
パスワード：誕生日４桁

※atama＋ログイン(WEB版)と上記に表示されます。
　アプリストアからダウンロードできるatama＋アプリ版やatama＋HOMEからはログインできません。
※推奨ブラウザをお使いいただくと、ホーム画面に追加が可能です。
　（推奨ブラウザ：android→google chrome／iPhone,iPad→Safali）

■操作方法
操作方法について以下URLから動画を確認いただけます。
https://drive.google.com/file/d/1n9yLmZmD06vPet3WMr55LHJT-icDxdTl/view?usp=sharing

対話式進学塾１対１ネッツ`;
LCT.TEMPLATE.Mail.howtoZoom = `■ログイン方法
＜PCの場合＞
　・WEBブラウザで上記URLにアクセスすると、自動的にアプリがダウンロードされ起動します。
　・初回のみ、ダウンロードで数分かかりますので時間にご注意ください。
＜スマートフォン・タブレットの場合＞
　・あらかじめ、PlayストアまたはApp Storeで「Zoom」と検索し、青色アイコンのアプリをダウンロードしてください。
　・その後、上記URLをタップするとZoomアプリが自動的に起動し、面談が開始されます。
　・メールを受け取る端末とZoomを利用する端末が異なる場合は、Zoomアプリを開いてミーティングIDとパスコードを入力してください。
`;
LCT.TEMPLATE.Meeting = {
  1: dateStr => {
    return `【１対１ネッツ】三者面談日程のご案内
お世話になります。ネッツです。
面談日程希望調査にご回答頂き、ありがとうございます。
${dateStr}
で、予約させて頂きました。
教室にて対面で実施させていただきます。
日程にご都合の悪い場合はお電話およびアプリからご連絡くださいませ。

１対１ネッツ
辰野`;
  },
  2: dateStr => {
    return `【１対１ネッツ】オンライン面談日程のご案内
お世話になります。ネッツです。
面談日程希望調査にご回答頂き、ありがとうございます。
${dateStr}
で、予約させて頂きました。
なお、Zoomのログイン方法およびアドレスは、日程が近づきましたら、また改めて送付させていただきます。
日程にご都合の悪い場合はお電話およびアプリからご連絡くださいませ。

１対１ネッツ
辰野`;
  }
};

LCT.MYPROFILES = {};
LCT.MYPROFILES.defalut = {
  mode_special: 1,
  mode_area: 1,
  NMmode: 'normal',
  notification: 'false',
  myname: '辰野　由弥',
  mynumber: '000231',
  myarea: 'a5031',
  mygroup: 'b3403',
  mybase: '3416',
  mybasename: '広島駅前'
};
